abstra_notas/nfse/ce/fortaleza/templates/ConsultaNFePeriodo.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
    xmlns:ns="http://www.fortaleza.ce.gov.br/iss">
    <soap:Header/>
    <soap:Body>
        <ns:ConsultarNfseServicoPrestado>
            <ns:ConsultarNfseServicoPrestadoEnvio>
                <ns:Prestador>
                    <ns:Cnpj>{{ remetente if remetente_tipo == '2' else '' }}</ns:Cnpj>
                    {% if remetente_tipo == '1' %}
                    <ns:Cpf>{{ remetente }}</ns:Cpf>
                    {% endif %}
                    {% if inscricao_prestador %}
                    <ns:InscricaoMunicipal>{{ inscricao_prestador }}</ns:InscricaoMunicipal>
                    {% endif %}
                </ns:Prestador>
                <ns:PeriodoEmissao>
                    <ns:DataInicial>{{ data_inicio }}</ns:DataInicial>
                    <ns:DataFinal>{{ data_fim }}</ns:DataFinal>
                </ns:PeriodoEmissao>
                {% if pagina > 1 %}
                <ns:Pagina>{{ pagina }}</ns:Pagina>
                {% endif %}
            </ns:ConsultarNfseServicoPrestadoEnvio>
        </ns:ConsultarNfseServicoPrestado>
    </soap:Body>
</soap:Envelope>
